Repository: atlas-studios/Session2-G9
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 江逸不明白这些，他短时间内学不会炼丹，丹房内的丹药他不敢动，唯有打这废丹的注意了。
en_us: Jiang Yi did not comprehend any of this. As he could not learn how to refine elixirs in a short time period, and as he did not dare to touch any of the elixirs in the alchemy lab, he had no choice but to make use if the useless elixirs.

source: 江逸不甘心，又盘坐入定运转无名决，但小半个时辰之后，他无奈的睁开眼睛，丹田内的黑色元力一丝都没有增加！
en_us: Jiang Yi was discontent and once again sat cross-legged to meditate and operate the nameless technique. Yet one short hour later, he had no choice but to open his eyes—the black essence force in his dantian had not increased by a single strand!

source: 江逸不退反进，气势汹汹，凭借刚才连续击伤两人之威竟把对方吓到了，那人身子畏缩的退后两步，脚步一踉跄，差点摔倒在地……
en_us: Jiang Yi surged forward in an aggressive, imposing manner. Relying on the power of consecutively attacking and injuring two persons alone, he had managed to shock his opponent. That person had flinched his body and retreated backward in two steps—yet as he did so, he stumbled and almost fell to the ground...

source: 江逸中饭都没吃却丝毫不觉得饥饿，全神贯注的沉寂在修炼中。下午不断有公子小姐来寻找陪练对战，杨管事果然没有再叫江逸上场。
en_us: Despite not having eaten lunch, Jiang Yi did not feel hungry at all. Instead, his attention was fully focused on his power cultivation practice, which he was conducting alone. In the afternoon, there had been a continuous stream of young masters and young mistresses who came in search of sparring partners for combat training, yet as promised Manager Yang had indeed not called Jiang Yi out to fight.

source: 江逸中饭都顾不上吃了，戴上斗篷朝武殿内走去。
en_us: Without caring to eat his lunch, Jiang Yi put on his robes and walked in the direction of the Martial Arts Hall.

source: 江逸也准备走了，黑色元力只有一缕了，他再上场别说翊小姐这级别的武者，就算铸鼎境二重对手也只有被虐的份。他原本还天真的想着进来混个金牌陪练，赚钱还债，此刻看来这钱的确不好赚……
en_us: Jiang Yi was also ready to leave. With only one wisp of black essence force left, if he went up for combat again, to say nothing of high-ranking martial artists like Young Mistress Yi, even an opponent with a power level at the second stage of the Cast Tripod Realm would be capable of abusing him. Initially he had naively thought of joining the Martial Arts Hall and pass off as a gold token-grade sparring partner to earn money and repay his debts. At the moment, it seemed like this money was indeed not easily earned...

source: 江逸也很不幸，因为此刻他在武殿内又一个小姐点将了，而这个小姐身边跟着的两个公子脸色明显有些臭了……
en_us: In the same sense, Jiang Yi was also unlucky: he just got ordered by yet another young mistress, and those two young masters accompanying her were showing clear contempt...

source: 江逸也有逆鳞，那就是……江小奴！
en_us: Jiang Yi had a reverse scale too, and it was… Jiang Xiaonu!

source: 江逸人在半空，脸上神情却没有半丝慌乱，反而眼中含着莫名笑意，在身子离开江如虎两尺距离时候，他突然张开大嘴，一口鲜血狂喷而出，喷得江如虎满头满脸都是……
en_us: While Jiang Yi was flying in mid-air, his facial expressions did not reveal any strand of frantic confusion; rather, his eyes revealed a mysterious look of glee. Right when his body was just two-thirds of a metre away from Jiang Ruhu, he suddenly opened his mouth wide and spit out a mouth full of fresh blood, drenching Jiang Ruhu's head and face completely...

source: 江逸从小到大很少流泪，除了大长老失踪那一夜他哭了，除了小时候江小奴被人打了他哭了，其外就算他被打得吐血，被打断骨头，被打得遍体鳞伤，甚至昏死过去他都没流泪，但此刻眼泪却如决堤的河水般，一发不可收。
en_us: Jiang Yi rarely cried throughout his life, except for the night when Grand Elder vanished and whenever Xiaonu was beaten up when they were little. Other times, even if he was beaten up so badly that he vomited blood, his bones broke, or basically beaten black and blue, even if he fainted and was on the verge of death, he never shed a tear. This time, however, the tears were flowing unstoppably like water through a broken dam.

source: 江逸从怀中取出一片紫金叶子递给江小奴道：“这金叶子你拿着，我不在的这三个月你要好好照顾自己，你牢记一点——千万别出江家大院，风月楼表面虽然不会找麻烦，但你出去乱转难免会出事情，你在大院内没有人能伤害你的。要是有人问你我去哪了，你就说我外出三月，但不能说我去武殿做事了，知道吗？”
en_us: Jiang Yi gave a piece of purple gold leaf to Xiaonu and enjoined her, "Here, keep this gold leaf and take good care of yourself in the three months that I'm gone. Bear one thing in mind - under no circumstance are you to leave the Jiang Clan courtyard; Fengyue Brothel will not ostensibly come looking for trouble, but that can't be guaranteed if you wander out. As long as you are in this courtyard, no harm would come to you. Anyone asks my whereabouts, just tell them I'm going away for three months, but do not divulge that I'm working at the Martial Arts Hall, do you understand?" "

source: 江逸从梦中猛然惊醒，却扯到伤口，痛嚎得整张脸顿时扭曲了，羸弱的身子不断抽动。
en_us: Jiang Yi abruptly woke up from his dream. He had accidentally opened his bodily injuries in the process and grimaced as his frail body struggled to endure yet another wave of agony.

source: 江逸以前还惊疑，江恨水只比他大三个月，修炼速度为何能如此之快？都达到铸鼎境八重了。现在却释然了，江恨水天资本身就不错，丹药从不缺，没事还来这武殿闭闭关，有各种资源任意挥霍，修炼速度能慢吗？
en_us: Jiang Yi used to be very startled about how Jiang Henshui, despite being only older than him by just three months, could have a power cultivation speed that was so fast; and now his power level had already reached the eighth stage of the Cast Tripod Realm. Jiang Yi felt relieved - after all, Jiang Henshui had a natural talent that was not too bad, had an abudance of elixirs to use and could even go into seclusion at this Martial Arts Hall when he had nothing to do. Likewise, considering how Jiang Yi now had all sorts of resources to consume at will, how could his own power cultivation speed be slow now?

source: 江逸低头一看，看到自己穿着的破烂布鞋苦笑起来，这是江小奴为他缝制的，因为大半年没换，上面的三个补丁很是显眼。
en_us: Jiang Yi bent his head down to take a look and, upon seeing the worn-out tattered cloth shoes he was wearing, he started laughing bitterly. This pair of shoes was sewn for him by Jiang Xiaonu. As he had not procured new shoes in over half a year, there were three patches on his shoes which were very eye-catching.

source: 江逸低头抱拳行礼，嘴角一阵苦涩，他这位落魄的旁系少爷还得给一个小管事行礼……
en_us: Jiang Yi lowered his head, cupped his fists together, and bowed deeply. He muttered to himself bitterly that it was inconceivable that a young master like him had fallen from grace so badly that he had to greet and bow to a small supervisor…

source: 江逸低头沉吟起来，内心却还是惊疑不定，天上掉馅饼了？武者越到后面境界越难提升，需要的元力越多，除非武殿给予他足够的高级丹药，否则两个月内绝对无法提升到铸鼎境四重。花费如此巨资？只为让他留在这陪练？陪练时还薪水照付？天下怎么会有如此好的事情？
en_us: Jiang Yi lowered his head and started muttering to himself. He still felt much bewilderment and anxiety in his heart. How could it be that something so good could fall into his lap? Martial artists found it ever-increasingly difficult to increase their power levels the high stages in the Cast Tripod Realm they got to, requiring ever-more essence force to make the increament. Unless the Martial Arts Hall gave him enough high-quality elixirs, he would definitely not be able to increase his power levels up to the fourth stage of the Cast Tripod Realm within two months. On top of that, how could possibly be willing to send so much money on him? Did they truly want him to stay and just be a sparring partner? Did they claim to give him a salary without changes to normal rates given to other sparring partners? How could such a good thing exist in this world?

source: 江逸低头沉默，内心却是苦笑连连，这个世界果然很残酷，如果不是因为自己黑色元力特殊，如果不是自己炼制的那几枚丹药，如果不是自己能很诡异的帮人武技大成，这姬听雨和翊凌雪恐怕看都不会看自己一眼吧？自己正因为有利用价值，她们才会放下身段主动和他交朋友吧？原本他还天真的以为，这两人是真的当他是朋友……
en_us: Jiang Yi bent his head wordlessly, although he was chuckling bitterly on the inside. The world was indeed cruel. If not for the special black essence force and the elixirs he made, or the fact that he could strangely help others' martial art techniques achieve phenomenal success, would Ji Tingyu and Yi Lingxue have spared him a second glance? They probably only stooped down to befriend him because he was of use to them. And to think he had so naively presumed they genuinely treated him like a friend...

source: 江逸低着头咬着牙，一步步朝江如鹰走去，在离开他三尺时缓缓弯下身子，准备跪在地上朝江如鹰胯下爬过去……
en_us: With his head lowered and his teeth grit, Jiang Yi walked towards Jiang Ruying step by step. When he was just a metre away from Jiang Ruying, he slowly bent down his body as he got ready to squat on the ground and crawl in the direction of the area underneath Jiang Ruying's groin...

source: 江逸低着头快速行走，很快走到了广场南边的一座气派恢弘的三层阁楼前。
en_us: With his head lowered, Jiang Yi walked speedily forward, quickly arriving at a vast imposing three-storey building at the south side of the city plaza.

source: 江逸余光一直锁定江如虎，哪能让他溜走？当下脚上踏出奇诡的步法，速度陡然飙升轻松穿过人群，一只铁拳朝江如虎砸去。这是他第一次动用极神步，尽管很有可能被认出来，但他也顾不了那么多了……
en_us: Jiang Yi's sights were locked on Jiang Ruhu, how could he allow him to slip away? Using an odd footwork, Jiang Yi's speed increased as he traversed through the crowd and launched an iron first at Jiang Ruhu. This was his first time using the Extreme Divine Steps. He couldn't care whether was there any possibility of it being recognized.

source: 江逸倒是没有去追，怎么说这里是江家大院，要是被刑堂知道了，他和江松两人都要责罚的。江家暗中纵容子弟们争斗，但表面上还是要维持一下族规的威严的。
en_us: On the other hand, Jiang Yi did not chase after him. After all, this was the central court. Should the disciplinary court find out about the fight, both Jiang Song and him would have to face punishment. The Jiang Clan tolerated in secret the fights occurring between their descendants, but on the surface, they still had to maintain the authority of the clan rules.

source: 江逸倒是没觉得什么，它本身就境界低，他不仅不沮丧反而无比期待，等他境界不断提升，提升到铸鼎境四重五重，他的综合战力该有多强大？
en_us: Jiang Yi on the other hand did not find this that big of a deal. His power level was originally already at a low Cast Tripod Realm stage. Not only was he not dejected about it, rather he looked forward incomparably towards the future. He wondered how powerful his combined combat ability would be, once his power-level had continuously increased such that it expands to being the fourth or even fifth stage of the Cast Tripod Realm.

source: 江逸偷偷缩回脑袋，暗暗沉吟起来，但这一刻，房间内那柳长老却突然爆喝起来：“江松，你在外面鬼鬼祟祟干什么？还不快滚进来回火？废物一个，天天就知道偷懒。”
en_us: Jiang Yi muttered to himself, lowering his head. However, at that moment, Elder Liu suddenly shouted from inside the room, "Jiang Song, what are you doing suspiciously standing outside? Faster! Get in here and temper the flames! Useless boy, all you know how to do is to laze around all day."

source: 江逸傻愣愣地看着痛得在地上打滚的江豹，一时半会两个人都没法接受眼前的结果。
en_us: Jiang Yi stared blankly at Jiang Bao rolling around on the ground in pain, and for a short while both of them could not comprehend what just happened.

source: 江逸元力疯狂运转，身子一闪已经到了此人面前，闪电般的抬手一巴掌，在对方还没反应之前扫在他脸上，那人立即倒飞出去数丈，重重的砸在地面。
en_us: Jiang Yi's essence force frenziedly circulated, Jiang Yi flashed right in front of the one who scolded him and gave him a lightning quick slap before he could even react. The collateral descendant flew back by several meters and crashed onto the ground.

source: 江逸内心长叹一声，抬起头望着姬听雨道：“姬小姐，恐怕要让你失望了，那种丹药你再也看不到了，否则我也不会来这做陪练了，那位炼丹师……死了。”
en_us: Jiang Yi heaved a long sigh internally and looked up at Ji Tingyu, "Young Mistress Ji, I'm afraid I'll have to let you down. You will never be able to see those elixirs again, or I would have come here to work as a sparring partner otherwise. You see, that alchemist... had died."

source: 江逸内视了一遍，生怕药力消耗过快，不敢过多的停留，开始转而提炼黑色元力。这一提炼他就感觉不同了，在这灵神丹的增幅下，他提炼黑色元力的速度也增快了三倍，仅仅只是大半个时辰，就提炼出六缕了。
en_us: Using his inner vision and observing the conditions in his body, and scared that the medical efficacy would run out too quickly, Jiang Yi did not dare to stay working on the same activity for too long. Instead, he changed his actions and started extracting more black essence force. He felt that his extraction experience this time was different. With the increase in power brought by that Spirit Pill, the speed at which he extracted black essence force had also increased by three times - in just an hour's time, he managed to extract six wisps.

source: 江逸再次苦涩一笑，江恨水果然不愧是天之骄子，闭个关都要去武殿？只比他大三个月，却要冲击铸鼎境九重了。如此年纪，能达到铸鼎境八重的天才，整个天羽城不超过五人吧？
en_us: Jiang Yi smiled bitterly once again. Jiang Henshui undoubtedly deserved to be the pride of the heavens. His choice of location for seclusion was, of all places, the prestigious martial arts hall? Furthermore, he was only three months older than Jiang Yi, yet he was already going to hit the ninth stage of the Cast Tripod Realm. The number of geniuses who, at such a young age, were already at the eighth stage of the Cast Tripod Realm numbered not more than five in the entire Skyplume City.

source: 江逸冷哼一声，手却不松开，那胖掌柜面色一变，连忙尴尬笑道：“看来客官是熟客了，得……一共收你九十两银子。”
en_us: Jiang Yi snorted coldly and refused to release his grip. The plump shopkeeper's facial expression changed. He gave a forced, awkward laugh. "Looks like my dear customer is indeed a regular. How about... ninety taels of silver?"

source: 江逸冷笑一声，也不退开躲避，反手抓起江如虎剩下的一条好腿，将他臃肿的身子就这样抡了起来朝众人横扫而去。
en_us: Jiang Yi gave a burst of cold laughter. Not only did he not retreat to avoid the incoming assault, he instead used his hand to grab Jiang Ruhu's remaining unbroken leg, swinging swinging Jiang Ruhu's obese body around in a sweeping motion in the direction of the incoming group of opponents.

source: 江逸刚准备讪讪的走出去，听到这长老的话立即一怔，连忙摆手摇头道：“不行啊，柳长老，我不懂炼丹啊，我不行的……”
en_us: Jiang Yi was just ready to leave in shame, but upon hearing the elder's orders he was immediately stumped for words. He hurriedly gestured his hands and shook his head in the negative, replying, "No way, Elder Liu, I don't know how to refine elixirs. I can't do it..."

source: 江逸刚刚修炼了一会就被打断，此刻又被带到这样一个小房间内，还好这里面坐着的是杨管事，让他微微心安。
en_us: Jiang Yi had just started cultivation practice for a while before he was interrupted. At the moment, being brought into a small room like that, and seeing that the person sitting in the room was none other than Manager Yang, he managed to feel slightly more calm.

source: 江逸刚刚出现在练功房大殿内，一群人目光立即扫了过来，那杨管事一张满是褶皱的老脸笑开了花，老远就叫道：“苍狼，你可来了！怎么样？留下陪练一下午吧？我按一天的工钱算你的，十两银子如何？”
en_us: Just as Jiang Yi walked into the large hall of the Technique Practising Room, the glances of a big group of people immediately swept over to look at him. Manager Yang, his old face filled with wrinkles, smiled brightly and called Jiang Yi from afar, saying, "Lone Wolf, you're finally here! How about it? Are you staying to be a sparring partner for a whole afternoon? I'll pay you a whole day's work worth of wages - so how does ten taels of silver sound?"

source: 江逸刚刚在大殿内盘坐下来，走廊内很快响起一阵急迫的脚步声，一道火红色的身影出现，一双大眼睛一眼就锁定江逸，兴奋的说道：“杨管事，我要和那个苍狼陪练对战。”
en_us: Jiang Yi had just started sitting cross-legged in the large hall, when the sound of urgent footsteps came ringing from the corridor. A fiery red figure appeared. Her pair of large eyes locking onto Jiang Yi with just one look, the figure excitedly said, "Manager Yang, I want that Lone Wolf to join me in sparring practice."

source: 江逸刚刚想走，那杨管事立即就拦住了他，江逸一愣连忙一边解下面具，一边说道：“管事，这陪练我不干了，钱我也不要了，这面具还给你吧。”
en_us: Just as, Jiang Yi was just thinking of leaving, Manager Yang immediately stopped him. Distracted, Jiang Yi hurriedly removed his mask and at the same time said, "Manager, I quit this sparring partnership position, I don't want the money either. Let me return this mask to you."

source: 江逸刚刚背着小奴冲到门口，后院前门四道身影飙射而出，瞬间就把屋子给围了起来，一名管事模样的男子跟着冲出来，老远就尖叫起来：“哼！敢在风雨楼闹事，小野种，你这是想死了不成？给我打！”
en_us: just when Jiang Yi reached the door with Xiaonu on his back, four figures appeared in front of the backyard's door, surrounding them in an instant. A man who looked like a housekeeper rushed out. "Hmph!” he shouted. “How dare you make trouble in Fengyue Brothel? Little bastard, you wanna die? Beat him up!"

source: 江逸刚刚长吁叹了口气，突然脸色一变，表情仿佛见了鬼似的。
en_us: Jiang Yi had just heaved a sigh of relief when all the color in his face drained, as though he had just seen a ghost.

source: 江逸刚才在条件反射下使用的武技是人阶中品的“摔碑手”，尽管他从小悟性惊人，这招异常难练的摔碑手被他练的炉火纯青，运劲的巧妙曾让大长老也捋须微笑。
en_us: The spontaneous stroke that Jiang Yi delivered was just the Man-tier, medial-grade Wrestling Hand. Jiang Yi had practiced this unusual and difficult Wrestling Hand to perfection. The Grand Elder had once stroked his beard with a smile upon seeing him use it in such a deft manner.

source: 江逸刚走进来，大门就自动关闭了，他举目一望，看到这练功房还算宽敞，四周都悬挂着夜明珠，倒是对练的好地方。
en_us: It was not long after Jiang Yi had entered the room that the door automatically sealed shut. He raised his head and looked around, seeing that that room was relatively spacious, with night pearls suspended all around the four corners of the room. This was actually a pretty good place for training.

source: 江逸努力抑制住自己不要情绪化地发笑，再次运转最后的一丝黑色元力朝右眼角附近的穴脉内涌去。
en_us: Stifling a laugh, Jiang Yi once again transferred the final sliver of black essence force to the corner of his right eye's Zhanzhu acupuncture point.

source: 江逸单手接过杨管事丢过来的瓷瓶，打开瓶塞一看，见里面竟是三枚灵神丹。暗道武殿果然财大气粗，连忙拱手道谢朝外面走去，在门口时他突然想起什么，回头问道：“管事……如果五年未满，我不干了，或者我有事要暂时离开，那该如何？”
en_us: With a single hand, Jiang Yi received the porcelain bottle Manager Yang had threw over to him. Lifting the bottle lid and taking a look, he saw that there were actually three Spirit Pills inside. He muttered to himself about how the Martial Arts Hall was indeed a rich and imposing organisation. He promptly cupped his hands and thanked Manager Yang, as he walked towards the exterior of the room. At the door, he suddenly thought of something - which made him turn his head to ask, "Manager... if it has not been five years and I decide to quit, or if something happens to me and I need to leave temporarily, what happens then?"

source: 江逸却苦笑摇头道：“拿错了，你这笨丫头，我受的是内伤，去把家族赐予的那枚疗伤丹药拿来，这药膏放下吧，迟些你在伤口上敷着。”
en_us: However, Jiang Yi shook his head and said with a bitter smile, "You've taken the wrong one, you silly girl. I have internal injuries, so give me the injury-healing elixir bestowed by the family. Leave this ointment behind; you can apply it on your own injuries later."

source: 江逸压制内心的喜悦，排除杂念盘坐在地打坐起来。他准备修炼一个半时辰无名功法，再转修江水决恢复蓝色元力，等天快黑了就带着《药草简录》回去彻夜翻读，他现在可指望在炼丹房长久干下去，柳长老交代的事情不敢怠慢，否则昨天的江松就是他的下场……
en_us: Jiang Yi suppressed the elation in his heart as he tried to remove any miscellaneous thoughts, before sitting cross-legged and starting to meditate. He was ready to practice that nameless cultivation technique for three hours, before switching to practice the Jiang Water Art to recover some blue essence force, and then bring the book "Record on Medicinal Herbs" back home when the sky turned dark to read through it all night long. He hoped to continue working long-term at the Alchemy Lab—which meant he did not dare to be slow in obeying Elder Liu's instructions, otherwise his fate would be the same as Jiang Song's...

source: 江逸原本就没想过把事情闹大，让家族全部人获悉他实力突飞猛进的事情，他是故意“提醒”江如虎，此事不要传扬出去的。
en_us: Jiang yi originally had no desire to make a big fuss out of the entire event and thereby allow everyone in the Family to find out about the circumstance of his power improving by leaps and bounds. He had deliberately "reminded" Jiang Ruhu not to widely spread this specific circumstance.

source: 江逸双手如两根海藻般分别朝两人缠去，轻松把慌乱之中的两人手臂缠住，身子朝旁边一转，双手顺势拉着两人朝前方冲去，单腿如毒蛇般朝两人双腿扫去。
en_us: Jiang Yi's hands individually aimed to entagle each of the two opponents like two strands of seaweed, easily entangling both persons' arms amidst the confusion. As his body turned to his side and started rushing forward, both of his hands took advantage of the situation and pulled his two opponents into the same direction as he did, while one of his legs swept across to both their legs like a poisonous snake.

source: 江逸反反复复将那些黑色小字默念了好几遍，感觉这份口诀迥然不同于他小时候尝试的众多修炼元力的功法，很是奇异。但心中好奇想要尝试的念头一旦生出，就如同燎原的野火般，再也无法熄灭。
en_us: As Jiang Yi repeatedly mouthed those tiny black words again and again, he could feel that this formula was vastly different compared to the multitude of cultivation techniques he tried when he was younger to boost his essence force. It was definitely bizarre. Nonetheless, once that curiosity to experiment and try was borne in his heart, that desire exploded like a wildfire and was unable to ever be extinguished!

source: 江逸取出怀中的小瓷瓶递了过去，那管事倒出一枚，仔细观看一会又闻了闻，最后皱着眉头道：“你这丹药，我从没看过，所以无法鉴定，请稍等，我去请我们聚珍阁的炼丹师鉴定下。”
en_us: Jiang Yi took out the porcelain bottle from his chest pockets and handed it over. The housekeeper poured a pill out of the bottle, inspecting it carefully for a moment and even took a sniff of it. Finally, he gave a frown and said, "Your elixir, I've never seen it before, so I have no way to appraise it. Please wait, I shall invite our alchemist working at the Pearl Gathering Pavilion to appraise it."

source: 江逸另外一只拳头长驱而入，重重一拳砸在马飞的面门上，打得他鼻血直喷，身子后仰差点摔倒。此刻江逸的身子也落地了，单手一探抓起落地的匕首，闪电般的架在马飞的脖子上，冷喝道：“不想你家少爷死，全部住手！”
en_us: Jiang Yi's other fist burst straight forth and smashed hard against Ma Fei's face, causing blood to sprout out of his nose profusely and knocking him backwards. Jiang Yi, who had landed on the ground in the meantime, grabbed the fallen short sword and held it against Ma Fei's neck in one lightning-quick move. He demanded coldly, "All of you stop right now if you don't want your young master to die!"

source: 江逸只是观摩了一上午，并不是太懂，感应到丹炉内内热气腾腾，那两枚废丹在吸收蓝色元力，立即运转出一缕黑色元力注入丹炉内。
en_us: Jiang Yi had only observed for a single morning and as such, was not very familiar with the refining methods. Sensing that the interior of the cauldron had become piping hot, and that the two useless elixirs were absorbing his blue essence force, he immediately circulated a wisp of black essence force and injected it into the cauldron.

source: 江逸可不敢随便找地方出售丹药，万一被人起疑心贪心就麻烦了。整个天羽城都是姬家的，聚珍阁内什么宝物没见过？自然也不会来坑他这等小人物了。
en_us: Jiang Yi did not dare to randomly choose a location to sell his elixirs, for in the event that he aroused suspicion and greed in others, he would surely be in trouble. The entire Skyplume City belonged to the Ji Family - what types of treasures had the Pearl Gathering Pavilion not encountered before? Naturally, they would not cheat a small fry like him either.

source: 江逸可没犯糊涂，这风月楼既然能成为东城最大的青楼，背后会被没有大势力支持？刚才他冲进来的时候，可是隐约看到内堂角落内有几名护卫守卫，这要是被围上了就麻烦了……
en_us: Jiang Yi was no fool. For Fengyue Brothel to become the biggest brothel in East City, how could it not have a major faction backing it? When he rushed in earlier, he had caught a glimpse of a few sentries and guards in the inner hall. It would be a problem if they got surrounded…

source: 江逸吐出嘴里的一丝淤血，在半空中强行控制身形，单拳元力流转，朝江如虎的脑袋砸去。营造出如此好的机会，他还不知道抓住的话就是白痴了。
en_us: Jiang Yi spit out a thread of clotted blood from his mouth and forcefully controlled his body figure whilst in mid air. Circulating essence force on one of his fists, he smashed that fist towards the direction of the top of Jiang Ruhu's head. Having established such as good opportunity to strike, he would be an idiot if he did not fathom to grasp it.

source: 江逸听到消息后，浑身轻松下来，他知道最少在江如龙没从武殿出来之前，他是安全的。他可以从容的修炼，不断破解封印，争取在短时间内提高境界。
en_us: Upon hearing the news, Jiang Yi felt more relaxes and less tense throughout his body. He knew that, at the very least, he would be safe before Jiang Rulong returned from the Martial Arts Hall. He could unhurriedly cultivate his power and continously break his seal, and in turn achieve the largest increase in his power-level stages in the Cast Tripod Realm in the shortest amount of time.

source: 江逸听闻背后的风声猛然回头一望，顿时大怒。当年他悟性惊人，在江家地位尊荣，所以看过很多江家武技，江松此刻使出来的武技他一眼就能认出。
en_us: Jiang Yi heard the sound of a breeze coming from his back and abruptly took a look back. He flew into a rage at that instant. All those years ago, when his position in the Jiang Clan was well-respected due to his astonishingly high talent, he had seen many martial art techniques practiced by the Jiang Clan. Thus he could recognize with one look the technique used by Jiang Song at that instant.

source: 江逸呆呆地看着眼前格外清晰的一切，连墙角那只蜘蛛腿上有毛他都能看得清清楚楚，而且似乎……那蜘蛛爬走的动作慢得吓人，就像慢动作一般。
en_us: Jiang Yi stared at the clear and distinct surroundings in a daze. He could clearly see the hairs on the legs of the spider on the wall. Moreover, the spider's movement was scarily slow, like a slow-motion picture.
